app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "email_notifications_opt", "cell_phone", "sms_notifications_opt", "password", "password_confirmation", "enabled", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "email_notifications_opt" = $3, "cell_phone" = $4, "sms_notifications_opt" = $5, "password" = $6, "password_confirmation" = $7, "updated_at" = $8 WHERE "users"."id" = $9

  def forgot_password
    @user = User.find_by(email: user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com1"], ["LIMIT", 1]]

  def reset_password
    @user = User.find_by(email: user_params[:email], reset_password_token: user_params[:old_password])
    if @user && @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."reset_password_token" = $2 LIMIT $3  [["email", "test@test.com1"], ["reset_password_token", "771268"], ["LIMIT", 1]]
UPDATE "users" SET "user_id" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["user_id", 12345], ["password", "1234567889"], ["updated_at", 2017-02-22 12:11:53 UTC], ["id", 4]]